<a href="https://colab.research.google.com/github/bl00p1ng/Curso-analisis-de-datos-con-Pandas-y-Python/blob/main/dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Curso de Manipulaci칩n y An치lisis de Datos con Pandas y Python

## 游닄 M칩dulo 1. Comenzando con pandas

### Clase 4. De paneles de datos al DataFrame

In [ ]:
# Actualizar pandas
!pip install --upgrade pandas

In [1]:
import pandas as pd
pd.__version__

'1.2.4'

In [2]:
dict_data = {'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

Es posible convertir un diccionario en un DataFrame. Al hacer esto las llaves del diccionario pasan a ser el encabezado de cada categor칤a de datos y los valores del diccionario se convierten en los datos de cada columna del DataFrame

In [3]:
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [4]:
import numpy as np

In [5]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [6]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

Obtener un resumen con la estructura de las variables y el tipo de datos que contienen:

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ana to gabriela
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   edad    7 non-null      int64
 1   cm      7 non-null      int64
 2   pais    7 non-null      object
 3   genero  7 non-null      object
 4   Q1      6 non-null      float64
 5   Q2      7 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 692.0+ bytes

Los DataFrames tienen diferentes propiedades que permiten obtener datos como los 칤ndices del DataFrame o sus diferentes columnas:

In [7]:
# Obtener 칤ndices
df.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [8]:
# Obtener columnas
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [9]:
# Obtener los valores del DataFrame
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

Si se quiere crear un **subconjunto a partir de los datos de una columna**, basta con poner el nombre de la columna entre []

In [10]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

Para obtener un **subconjunto en base a varias columnas** hay que crear una lista con los nombres de dichas columnas:

In [11]:
df[['edad', 'cm', 'Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

Es posible traer los datos de una fila espec칤fica. Para ello se usa `loc`

In [12]:
df.loc[['ana'], ['edad', 'cm', 'Q1']]

     edad   cm   Q1
ana    10  115  5.0

In [13]:
df.loc[['ana', 'gabriela'], ['edad', 'cm', 'Q1']]

          edad   cm   Q1
ana         10  115  5.0
gabriela    12  125  3.0

In [14]:
df.loc[['fabian'], ['Q1']]

         Q1
fabian  8.0

Adicionalmente es posible obtener datos no s칩lo por su fila o columna sino tambi칠n por su posici칩n en el DataFrame

In [15]:
df.iloc[2, 1]

130

In [16]:
df.iloc[2, [1, 3]]

cm        130
genero      F
Name: camilo, dtype: object

In [17]:
df.iloc[[2, 4, 5], [1, 3]]

         cm genero
camilo  130      F
erika   125      M
fabian  120      M

Se puede seleccionar toda una fila o columna usando `:`

In [18]:
df.iloc[:, [1, 3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

#### Filtros b치sados en condiciones

_**Ejemplo:**_

Conocer que estudiantes tienen una edad mayor o igual a 12 a침os

In [19]:
# Retorna una serie con valores booleanos que indican en donde se cumpli칩 la condici칩n
df['edad'] >= 12

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [20]:
# Crea un DataFrame con los elementos que cumplen la condici칩n
df[df['edad'] >= 12]

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9

Las condiciones se pueden combinar:

In [21]:
df[(df['edad'] >= 12) & (df['pais'] == 'mx')]

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

Hay una forma m치s sencilla de hacer estas consultas y es usando el m칠todo `query()`

In [22]:
df.query('edad > 12')

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8

#### Comparaciones entre columnas

_**Ejemplo:**_

Conocer que estudiantes tuvieron una calificaci칩n mejor en el Q2 comparado con el Q1

In [23]:
df['Q2'] > df['Q1']

ana          True
benito      False
camilo       True
daniel      False
erika        True
fabian      False
gabriela     True
dtype: bool

In [24]:
df[df['Q2'] > df['Q1']]

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9